NOVA-RICS-Open-Lab/FMS/src/Arduino/boards package/industrialshields/hardware/avr/1.1.46/boards.txt
menu.cpu=Model

############################
###### Ardbox ##############
############################

ardbox.name=Ardbox family
ardbox.vid.0=0x2341
ardbox.pid.0=0x0036
ardbox.vid.1=0x2341
ardbox.pid.1=0x8036
ardbox.vid.2=0x2A03
ardbox.pid.2=0x0036
ardbox.vid.3=0x2A03
ardbox.pid.3=0x8036

ardbox.upload.tool=avrdude
ardbox.upload.protocol=avr109
ardbox.upload.maximum_size=28672
ardbox.upload.maximum_data_size=2560
ardbox.upload.speed=57600
ardbox.upload.disable_flushing=true
ardbox.upload.use_1200bps_touch=true
ardbox.upload.wait_for_upload_port=true

ardbox.bootloader.tool=avrdude
ardbox.bootloader.low_fuses=0xff
ardbox.bootloader.high_fuses=0xd8
ardbox.bootloader.extended_fuses=0xcb
ardbox.bootloader.file=ardbox.hex
ardbox.bootloader.unlock_bits=0x3F
ardbox.bootloader.lock_bits=0x2F

ardbox.build.mcu=atmega32u4
ardbox.build.f_cpu=16000000L
ardbox.build.vid=0x2341
ardbox.build.pid=0x8036
ardbox.build.usb_product="Ardbox"
ardbox.build.board=AVR_LEONARDO
ardbox.build.core=industrialshields

## Ardbox Analog
## -------------------------
ardbox.menu.cpu.ardboxanalog=Ardbox Analog
ardbox.menu.cpu.ardboxanalog.build.variant=ardboxanalog
ardbox.menu.cpu.ardboxanalog.build.extra_flags={build.usb_flags} -DARDBOX -DARDBOX_ANALOG

## Ardbox Analog HF (with RS-232 hardware)
## -------------------------
ardbox.menu.cpu.ardboxanaloghf232=Ardbox Analog HF w/ HW RS-232
ardbox.menu.cpu.ardboxanaloghf232.build.variant=ardboxanaloghf
ardbox.menu.cpu.ardboxanaloghf232.build.extra_flags={build.usb_flags} -DARDBOX_HF -DARDBOX_ANALOG_HF -DARDBOX_ANALOG_HF_RS232

## Ardbox Analog HF (with RS-485 hardware)
## -------------------------
ardbox.menu.cpu.ardboxanaloghf485=Ardbox Analog HF w/ HW RS-485
ardbox.menu.cpu.ardboxanaloghf485.build.variant=ardboxanaloghf
ardbox.menu.cpu.ardboxanaloghf485.build.extra_flags={build.usb_flags} -DARDBOX_HF -DARDBOX_ANALOG_HF -DARDBOX_ANALOG_HF_RS485

## Ardbox Analog HF+ (with RS-232 hardware)
## -------------------------
ardbox.menu.cpu.ardboxanaloghfplus232=Ardbox Analog HF+ w/ HW RS-232
ardbox.menu.cpu.ardboxanaloghfplus232.build.variant=ardboxanaloghf
ardbox.menu.cpu.ardboxanaloghfplus232.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_ANALOG_HF_PLUS -DARDBOX_ANALOG_HF_PLUS_RS232

## Ardbox Analog HF+ (with RS-485 hardware)
## -------------------------
ardbox.menu.cpu.ardboxanaloghfplus485=Ardbox Analog HF+ w/ HW RS-485
ardbox.menu.cpu.ardboxanaloghfplus485.build.variant=ardboxanaloghf
ardbox.menu.cpu.ardboxanaloghfplus485.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_ANALOG_HF_PLUS -DARDBOX_ANALOG_HF_PLUS_RS485

## Ardbox Analog HF (legacy)
## -------------------------
ardbox.menu.cpu.ardboxanaloghflegacy=Ardbox Analog HF (legacy)
ardbox.menu.cpu.ardboxanaloghflegacy.build.variant=ardboxanaloghf
ardbox.menu.cpu.ardboxanaloghflegacy.build.extra_flags={build.usb_flags} -DARDBOX_HF -DARDBOX_ANALOG_HF -DARDBOX_ANALOG_HF_LEGACY

## Ardbox Relay
## -------------------------
ardbox.menu.cpu.ardboxrelay=Ardbox Relay
ardbox.menu.cpu.ardboxrelay.build.variant=ardboxrelay
ardbox.menu.cpu.ardboxrelay.build.extra_flags={build.usb_flags} -DARDBOX -DARDBOX_RELAY

## Ardbox Relay HF (with RS-232 hardware)
## -------------------------
ardbox.menu.cpu.ardboxrelayhf232=Ardbox Relay HF w/ HW RS-232
ardbox.menu.cpu.ardboxrelayhf232.build.variant=ardboxrelayhf
ardbox.menu.cpu.ardboxrelayhf232.build.extra_flags={build.usb_flags} -DARDBOX_HF -DARDBOX_RELAY_HF -DARDBOX_RELAY_HF_RS232

## Ardbox Relay HF (with RS-485 hardware)
## -------------------------
ardbox.menu.cpu.ardboxrelayhf485=Ardbox Relay HF w/ HW RS-485
ardbox.menu.cpu.ardboxrelayhf485.build.variant=ardboxrelayhf
ardbox.menu.cpu.ardboxrelayhf485.build.extra_flags={build.usb_flags} -DARDBOX_HF -DARDBOX_RELAY_HF -DARDBOX_RELAY_HF_RS485

## Ardbox Relay HF+ (with RS-232 hardware)
## -------------------------
ardbox.menu.cpu.ardboxrelayhfplus232=Ardbox Relay HF+ w/ HW RS-232
ardbox.menu.cpu.ardboxrelayhfplus232.build.variant=ardboxrelayhf
ardbox.menu.cpu.ardboxrelayhfplus232.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_RELAY_HF_PLUS -DARDBOX_RELAY_HF_PLUS_RS232

## Ardbox Relay HF+ (with RS-485 hardware)
## -------------------------
ardbox.menu.cpu.ardboxrelayhfplus485=Ardbox Relay HF+ w/ HW RS-485
ardbox.menu.cpu.ardboxrelayhfplus485.build.variant=ardboxrelayhf
ardbox.menu.cpu.ardboxrelayhfplus485.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_RELAY_HF_PLUS -DARDBOX_RELAY_HF_PLUS_RS485

## Ardbox Relay HF (legacy)
## -------------------------
ardbox.menu.cpu.ardboxrelayhflegacy=Ardbox Relay HF (legacy)
ardbox.menu.cpu.ardboxrelayhflegacy.build.variant=ardboxrelayhf
ardbox.menu.cpu.ardboxrelayhflegacy.build.extra_flags={build.usb_flags} -DARDBOX_HF -DARDBOX_RELAY_HF -DARDBOX_RELAY_HF_LEGACY

## Ardbox Basic Controller
## -------------------------
ardbox.menu.cpu.ardboxbasic=Ardbox Basic Controller
ardbox.menu.cpu.ardboxbasic.build.variant=ardboxbasic
ardbox.menu.cpu.ardboxbasic.build.extra_flags={build.usb_flags} -DARDBOX -DARDBOX_BASIC

############################
###### Ardbox DALI #########
############################

ardboxdali.name=Ardbox DALI family
ardboxdali.vid.0=0x2341
ardboxdali.pid.0=0x0036
ardboxdali.vid.1=0x2341
ardboxdali.pid.1=0x8036
ardboxdali.vid.2=0x2A03
ardboxdali.pid.2=0x0036
ardboxdali.vid.3=0x2A03
ardboxdali.pid.3=0x8036

ardboxdali.upload.tool=avrdude
ardboxdali.upload.protocol=avr109
ardboxdali.upload.maximum_size=28672
ardboxdali.upload.maximum_data_size=2560
ardboxdali.upload.speed=57600
ardboxdali.upload.disable_flushing=true
ardboxdali.upload.use_1200bps_touch=true
ardboxdali.upload.wait_for_upload_port=true

ardboxdali.bootloader.tool=avrdude
ardboxdali.bootloader.low_fuses=0xff
ardboxdali.bootloader.high_fuses=0xd8
ardboxdali.bootloader.extended_fuses=0xcb
ardboxdali.bootloader.file=ardbox.hex
ardboxdali.bootloader.unlock_bits=0x3F
ardboxdali.bootloader.lock_bits=0x2F

ardboxdali.build.mcu=atmega32u4
ardboxdali.build.f_cpu=16000000L
ardboxdali.build.vid=0x2341
ardboxdali.build.pid=0x8036
ardboxdali.build.usb_product="Ardbox"
ardboxdali.build.board=AVR_LEONARDO
ardboxdali.build.core=industrialshields

## Ardbox Analog HF+ (with RS-232 hardware)
## -------------------------
ardboxdali.menu.cpu.ardboxanaloghfplus232dali=Ardbox Analog HF+ w/ HW RS-232 DALI
ardboxdali.menu.cpu.ardboxanaloghfplus232dali.build.variant=ardboxanaloghf
ardboxdali.menu.cpu.ardboxanaloghfplus232dali.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_ANALOG_HF_PLUS -DARDBOX_ANALOG_HF_PLUS_RS232 -DARDBOX_DALI_HF_PLUS

## Ardbox Analog HF+ (with RS-485 hardware)
## -------------------------
ardboxdali.menu.cpu.ardboxanaloghfplus485dali=Ardbox Analog HF+ w/ HW RS-485 DALI
ardboxdali.menu.cpu.ardboxanaloghfplus485dali.build.variant=ardboxanaloghf
ardboxdali.menu.cpu.ardboxanaloghfplus485dali.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_ANALOG_HF_PLUS -DARDBOX_ANALOG_HF_PLUS_RS485 -DARDBOX_DALI_HF_PLUS

## Ardbox Relay HF+ (with RS-232 hardware)
## -------------------------
ardboxdali.menu.cpu.ardboxrelayhfplus232dali=Ardbox Relay HF+ w/ HW RS-232 DALI
ardboxdali.menu.cpu.ardboxrelayhfplus232dali.build.variant=ardboxrelayhf
ardboxdali.menu.cpu.ardboxrelayhfplus232dali.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_RELAY_HF_PLUS -DARDBOX_RELAY_HF_PLUS_RS232 -DARDBOX_DALI_HF_PLUS

## Ardbox Relay HF+ (with RS-485 hardware)
## -------------------------
ardboxdali.menu.cpu.ardboxrelayhfplus485dali=Ardbox Relay HF+ w/ HW RS-485 DALI
ardboxdali.menu.cpu.ardboxrelayhfplus485dali.build.variant=ardboxrelayhf
ardboxdali.menu.cpu.ardboxrelayhfplus485dali.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_RELAY_HF_PLUS -DARDBOX_RELAY_HF_PLUS_RS485 -DARDBOX_DALI_HF_PLUS

############################
###### Ardbox GPRS #########
############################

ardboxgprs.name=Ardbox GPRS family
ardboxgprs.vid.0=0x2341
ardboxgprs.pid.0=0x0036
ardboxgprs.vid.1=0x2341
ardboxgprs.pid.1=0x8036
ardboxgprs.vid.2=0x2A03
ardboxgprs.pid.2=0x0036
ardboxgprs.vid.3=0x2A03
ardboxgprs.pid.3=0x8036

