NOVA-RICS-Open-Lab/FMS/src/Arduino/boards package/industrialshields/hardware/avr/1.1.46/boards.txt
ardboxgprs.upload.tool=avrdude
ardboxgprs.upload.protocol=avr109
ardboxgprs.upload.maximum_size=28672
ardboxgprs.upload.maximum_data_size=2560
ardboxgprs.upload.speed=57600
ardboxgprs.upload.disable_flushing=true
ardboxgprs.upload.use_1200bps_touch=true
ardboxgprs.upload.wait_for_upload_port=true

ardboxgprs.bootloader.tool=avrdude
ardboxgprs.bootloader.low_fuses=0xff
ardboxgprs.bootloader.high_fuses=0xd8
ardboxgprs.bootloader.extended_fuses=0xcb
ardboxgprs.bootloader.file=ardbox.hex
ardboxgprs.bootloader.unlock_bits=0x3F
ardboxgprs.bootloader.lock_bits=0x2F

ardboxgprs.build.mcu=atmega32u4
ardboxgprs.build.f_cpu=16000000L
ardboxgprs.build.vid=0x2341
ardboxgprs.build.pid=0x8036
ardboxgprs.build.usb_product="Ardbox"
ardboxgprs.build.board=AVR_LEONARDO
ardboxgprs.build.core=industrialshields

## Ardbox Analog HF+ (with RS-232 hardware)
## -------------------------
ardboxgprs.menu.cpu.ardboxanaloghfplus232gprs=Ardbox Analog HF+ w/ HW RS-232 GPRS
ardboxgprs.menu.cpu.ardboxanaloghfplus232gprs.build.variant=ardboxanaloghf
ardboxgprs.menu.cpu.ardboxanaloghfplus232gprs.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_ANALOG_HF_PLUS -DARDBOX_ANALOG_HF_PLUS_RS232 -DARDBOX_GPRS_HF_PLUS

## Ardbox Analog HF+ (with RS-485 hardware)
## -------------------------
ardboxgprs.menu.cpu.ardboxanaloghfplus485gprs=Ardbox Analog HF+ w/ HW RS-485 GPRS
ardboxgprs.menu.cpu.ardboxanaloghfplus485gprs.build.variant=ardboxanaloghf
ardboxgprs.menu.cpu.ardboxanaloghfplus485gprs.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_ANALOG_HF_PLUS -DARDBOX_ANALOG_HF_PLUS_RS485 -DARDBOX_GPRS_HF_PLUS

## Ardbox Relay HF+ (with RS-232 hardware)
## -------------------------
ardboxgprs.menu.cpu.ardboxrelayhfplus232gprs=Ardbox Relay HF+ w/ HW RS-232 GPRS
ardboxgprs.menu.cpu.ardboxrelayhfplus232gprs.build.variant=ardboxrelayhf
ardboxgprs.menu.cpu.ardboxrelayhfplus232gprs.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_RELAY_HF_PLUS -DARDBOX_RELAY_HF_PLUS_RS232 -DARDBOX_GPRS_HF_PLUS

## Ardbox Relay HF+ (with RS-485 hardware)
## -------------------------
ardboxgprs.menu.cpu.ardboxrelayhfplus485gprs=Ardbox Relay HF+ w/ HW RS-485 GPRS
ardboxgprs.menu.cpu.ardboxrelayhfplus485gprs.build.variant=ardboxrelayhf
ardboxgprs.menu.cpu.ardboxrelayhfplus485gprs.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_RELAY_HF_PLUS -DARDBOX_RELAY_HF_PLUS_RS485 -DARDBOX_GPRS_HF_PLUS

############################
###### Ardbox WiFi #########
############################

ardboxwifi.name=Ardbox WiFi/BT family
ardboxwifi.vid.0=0x2341
ardboxwifi.pid.0=0x0036
ardboxwifi.vid.1=0x2341
ardboxwifi.pid.1=0x8036
ardboxwifi.vid.2=0x2A03
ardboxwifi.pid.2=0x0036
ardboxwifi.vid.3=0x2A03
ardboxwifi.pid.3=0x8036

ardboxwifi.upload.tool=avrdude
ardboxwifi.upload.protocol=avr109
ardboxwifi.upload.maximum_size=28672
ardboxwifi.upload.maximum_data_size=2560
ardboxwifi.upload.speed=57600
ardboxwifi.upload.disable_flushing=true
ardboxwifi.upload.use_1200bps_touch=true
ardboxwifi.upload.wait_for_upload_port=true

ardboxwifi.bootloader.tool=avrdude
ardboxwifi.bootloader.low_fuses=0xff
ardboxwifi.bootloader.high_fuses=0xd8
ardboxwifi.bootloader.extended_fuses=0xcb
ardboxwifi.bootloader.file=ardbox.hex
ardboxwifi.bootloader.unlock_bits=0x3F
ardboxwifi.bootloader.lock_bits=0x2F

ardboxwifi.build.mcu=atmega32u4
ardboxwifi.build.f_cpu=16000000L
ardboxwifi.build.vid=0x2341
ardboxwifi.build.pid=0x8036
ardboxwifi.build.usb_product="Ardbox"
ardboxwifi.build.board=AVR_LEONARDO
ardboxwifi.build.core=industrialshields

## Ardbox Analog HF+ (with RS-232 hardware)
## -------------------------
ardboxwifi.menu.cpu.ardboxanaloghfplus232wifi=Ardbox Analog HF+ w/ HW RS-232 WiFi/BT
ardboxwifi.menu.cpu.ardboxanaloghfplus232wifi.build.variant=ardboxanaloghf
ardboxwifi.menu.cpu.ardboxanaloghfplus232wifi.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_ANALOG_HF_PLUS -DARDBOX_ANALOG_HF_PLUS_RS232 -DARDBOX_WIFI_HF_PLUS

## Ardbox Analog HF+ (with RS-485 hardware)
## -------------------------
ardboxwifi.menu.cpu.ardboxanaloghfplus485wifi=Ardbox Analog HF+ w/ HW RS-485 WiFi/BT
ardboxwifi.menu.cpu.ardboxanaloghfplus485wifi.build.variant=ardboxanaloghf
ardboxwifi.menu.cpu.ardboxanaloghfplus485wifi.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_ANALOG_HF_PLUS -DARDBOX_ANALOG_HF_PLUS_RS485 -DARDBOX_WIFI_HF_PLUS

## Ardbox Relay HF+ (with RS-232 hardware)
## -------------------------
ardboxwifi.menu.cpu.ardboxrelayhfplus232wifi=Ardbox Relay HF+ w/ HW RS-232 WiFi/BT
ardboxwifi.menu.cpu.ardboxrelayhfplus232wifi.build.variant=ardboxrelayhf
ardboxwifi.menu.cpu.ardboxrelayhfplus232wifi.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_RELAY_HF_PLUS -DARDBOX_RELAY_HF_PLUS_RS232 -DARDBOX_WIFI_HF_PLUS

## Ardbox Relay HF+ (with RS-485 hardware)
## -------------------------
ardboxwifi.menu.cpu.ardboxrelayhfplus485wifi=Ardbox Relay HF+ w/ HW RS-485 WiFi/BT
ardboxwifi.menu.cpu.ardboxrelayhfplus485wifi.build.variant=ardboxrelayhf
ardboxwifi.menu.cpu.ardboxrelayhfplus485wifi.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_RELAY_HF_PLUS -DARDBOX_RELAY_HF_PLUS_RS485 -DARDBOX_WIFI_HF_PLUS

############################
###### Ardbox LoRa #########
############################

ardboxlora.name=Ardbox LoRa family
ardboxlora.vid.0=0x2341
ardboxlora.pid.0=0x0036
ardboxlora.vid.1=0x2341
ardboxlora.pid.1=0x8036
ardboxlora.vid.2=0x2A03
ardboxlora.pid.2=0x0036
ardboxlora.vid.3=0x2A03
ardboxlora.pid.3=0x8036

ardboxlora.upload.tool=avrdude
ardboxlora.upload.protocol=avr109
ardboxlora.upload.maximum_size=28672
ardboxlora.upload.maximum_data_size=2560
ardboxlora.upload.speed=57600
ardboxlora.upload.disable_flushing=true
ardboxlora.upload.use_1200bps_touch=true
ardboxlora.upload.wait_for_upload_port=true

ardboxlora.bootloader.tool=avrdude
ardboxlora.bootloader.low_fuses=0xff
ardboxlora.bootloader.high_fuses=0xd8
ardboxlora.bootloader.extended_fuses=0xcb
ardboxlora.bootloader.file=ardbox.hex
ardboxlora.bootloader.unlock_bits=0x3F
ardboxlora.bootloader.lock_bits=0x2F

ardboxlora.build.mcu=atmega32u4
ardboxlora.build.f_cpu=16000000L
ardboxlora.build.vid=0x2341
ardboxlora.build.pid=0x8036
ardboxlora.build.usb_product="Ardbox"
ardboxlora.build.board=AVR_LEONARDO
ardboxlora.build.core=industrialshields

## Ardbox Analog HF+ LoRa (with RS-232 hardware)
## -------------------------
ardboxlora.menu.cpu.ardboxanaloghfplus232lora=LoRa Ardbox Analog HF+ w/ HW RS-232
ardboxlora.menu.cpu.ardboxanaloghfplus232lora.build.variant=ardboxanaloghf
ardboxlora.menu.cpu.ardboxanaloghfplus232lora.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_ANALOG_HF_PLUS -DARDBOX_ANALOG_HF_PLUS_RS232 -DARDBOX_LORA_HF_PLUS

## Ardbox Analog HF+ LoRa (with RS-485 hardware)
## -------------------------
ardboxlora.menu.cpu.ardboxanaloghfplus485lora=LoRa Ardbox Analog HF+ w/ HW RS-485
ardboxlora.menu.cpu.ardboxanaloghfplus485lora.build.variant=ardboxanaloghf
ardboxlora.menu.cpu.ardboxanaloghfplus485lora.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_ANALOG_HF_PLUS -DARDBOX_ANALOG_HF_PLUS_RS485 -DARDBOX_LORA_HF_PLUS

## Ardbox Relay HF+ LoRa (with RS-232 hardware)
## -------------------------
ardboxlora.menu.cpu.ardboxrelayhfplus232lora=LoRa Ardbox Relay HF+ w/ HW RS-232
ardboxlora.menu.cpu.ardboxrelayhfplus232lora.build.variant=ardboxrelayhf
ardboxlora.menu.cpu.ardboxrelayhfplus232lora.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_RELAY_HF_PLUS -DARDBOX_RELAY_HF_PLUS_RS232 -DARDBOX_LORA_HF_PLUS

## Ardbox Relay HF+ LoRa (with RS-485 hardware)
## -------------------------
ardboxlora.menu.cpu.ardboxrelayhfplus485lora=LoRa Ardbox Relay HF+ w/ HW RS-485
ardboxlora.menu.cpu.ardboxrelayhfplus485lora.build.variant=ardboxrelayhf
ardboxlora.menu.cpu.ardboxrelayhfplus485lora.build.extra_flags={build.usb_flags} -DARDBOX_HF_PLUS -DARDBOX_RELAY_HF_PLUS -DARDBOX_RELAY_HF_PLUS_RS485 -DARDBOX_LORA_HF_PLUS


######################
###### M-Duino #######
######################

mduino.name=M-Duino family

