NOVA-RICS-Open-Lab/FMS/src/Arduino/boards package/industrialshields/hardware/avr/1.1.46/boards.txt
mduino.vid.0=0x2341
mduino.pid.0=0x0010
mduino.vid.1=0x2341
mduino.pid.1=0x0042
mduino.vid.2=0x2A03
mduino.pid.2=0x0010
mduino.vid.3=0x2A03
mduino.pid.3=0x0042
mduino.vid.4=0x2341
mduino.pid.4=0x0210
mduino.vid.5=0x2341
mduino.pid.5=0x0242

mduino.upload.tool=avrdude
mduino.upload.maximum_data_size=8192
mduino.upload.protocol=wiring
mduino.upload.maximum_size=253952
mduino.upload.speed=115200

mduino.bootloader.tool=avrdude
mduino.bootloader.low_fuses=0xFF
mduino.bootloader.unlock_bits=0x3F
mduino.bootloader.lock_bits=0x0F
mduino.bootloader.high_fuses=0xD8
mduino.bootloader.extended_fuses=0xFD
mduino.bootloader.file=mduino.hex

mduino.build.f_cpu=16000000L
mduino.build.core=industrialshields
mduino.build.mcu=atmega2560
mduino.build.board=AVR_MEGA2560
mduino.build.usb_product="M-Duino"

## M-Duino 19R
## -------------------------
mduino.menu.cpu.mduino19r=M-Duino 19R
mduino.menu.cpu.mduino19r.build.variant=mduinorelay
mduino.menu.cpu.mduino19r.build.extra_flags=-DMDUINO -DMDUINO_19R

## M-Duino 19R+
## -------------------------
mduino.menu.cpu.mduino19rplus=M-Duino 19R+
mduino.menu.cpu.mduino19rplus.build.variant=mduinoplus
mduino.menu.cpu.mduino19rplus.build.extra_flags=-DMDUINO_PLUS -DMDUINO_19R_PLUS

## M-Duino 21
## -------------------------
mduino.menu.cpu.mduino21=M-Duino 21
mduino.menu.cpu.mduino21.build.variant=mduino
mduino.menu.cpu.mduino21.build.extra_flags=-DMDUINO -DMDUINO_21

## M-Duino 21+
## -------------------------
mduino.menu.cpu.mduino21plus=M-Duino 21+
mduino.menu.cpu.mduino21plus.build.variant=mduinoplus
mduino.menu.cpu.mduino21plus.build.extra_flags=-DMDUINO_PLUS -DMDUINO_21_PLUS

## M-Duino 38AR+
## -------------------------
mduino.menu.cpu.mduino38arplus=M-Duino 38AR+
mduino.menu.cpu.mduino38arplus.build.variant=mduinoplus
mduino.menu.cpu.mduino38arplus.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38AR_PLUS

## M-Duino 38R
## -------------------------
mduino.menu.cpu.mduino38r=M-Duino 38R
mduino.menu.cpu.mduino38r.build.variant=mduinorelay
mduino.menu.cpu.mduino38r.build.extra_flags=-DMDUINO -DMDUINO_38R

## M-Duino 38R+
## -------------------------
mduino.menu.cpu.mduino38rplus=M-Duino 38R+
mduino.menu.cpu.mduino38rplus.build.variant=mduinoplus
mduino.menu.cpu.mduino38rplus.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38R_PLUS

## M-Duino 42
## -------------------------
mduino.menu.cpu.mduino42=M-Duino 42
mduino.menu.cpu.mduino42.build.variant=mduino
mduino.menu.cpu.mduino42.build.extra_flags=-DMDUINO -DMDUINO_42

## M-Duino 42+
## -------------------------
mduino.menu.cpu.mduino42plus=M-Duino 42+
mduino.menu.cpu.mduino42plus.build.variant=mduinoplus
mduino.menu.cpu.mduino42plus.build.extra_flags=-DMDUINO_PLUS -DMDUINO_42_PLUS

## M-Duino 50RRA+
## -------------------------
mduino.menu.cpu.mduino50rraplus=M-Duino 50RRA+
mduino.menu.cpu.mduino50rraplus.build.variant=mduinoplus
mduino.menu.cpu.mduino50rraplus.build.extra_flags=-DMDUINO_PLUS -DMDUINO_50RRA_PLUS

## M-Duino 53ARR+
## -------------------------
mduino.menu.cpu.mduino53arrplus=M-Duino 53ARR+
mduino.menu.cpu.mduino53arrplus.build.variant=mduinoplus
mduino.menu.cpu.mduino53arrplus.build.extra_flags=-DMDUINO_PLUS -DMDUINO_53ARR_PLUS

## M-Duino 54ARA+
## -------------------------
mduino.menu.cpu.mduino54araplus=M-Duino 54ARA+
mduino.menu.cpu.mduino54araplus.build.variant=mduinoplus
mduino.menu.cpu.mduino54araplus.build.extra_flags=-DMDUINO_PLUS -DMDUINO_54ARA_PLUS

## M-Duino 57AAR+
## -------------------------
mduino.menu.cpu.mduino57aarplus=M-Duino 57AAR+
mduino.menu.cpu.mduino57aarplus.build.variant=mduinoplus
mduino.menu.cpu.mduino57aarplus.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57AAR_PLUS

## M-Duino 57R
## -------------------------
mduino.menu.cpu.mduino57r=M-Duino 57R
mduino.menu.cpu.mduino57r.build.variant=mduinorelay
mduino.menu.cpu.mduino57r.build.extra_flags=-DMDUINO -DMDUINO_57R

## M-Duino 57R+
## -------------------------
mduino.menu.cpu.mduino57rplus=M-Duino 57R+
mduino.menu.cpu.mduino57rplus.build.variant=mduinoplus
mduino.menu.cpu.mduino57rplus.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57R_PLUS

## M-Duino 58
## -------------------------
mduino.menu.cpu.mduino58=M-Duino 58
mduino.menu.cpu.mduino58.build.variant=mduino
mduino.menu.cpu.mduino58.build.extra_flags=-DMDUINO -DMDUINO_58

## M-Duino 58+
## -------------------------
mduino.menu.cpu.mduino58plus=M-Duino 58+
mduino.menu.cpu.mduino58plus.build.variant=mduinoplus
mduino.menu.cpu.mduino58plus.build.extra_flags=-DMDUINO_PLUS -DMDUINO_58_PLUS

######################
#### M-Duino DALI ####
######################

mduinodali.name=M-Duino DALI family

mduinodali.vid.0=0x2341
mduinodali.pid.0=0x0010
mduinodali.vid.1=0x2341
mduinodali.pid.1=0x0042
mduinodali.vid.2=0x2A03
mduinodali.pid.2=0x0010
mduinodali.vid.3=0x2A03
mduinodali.pid.3=0x0042
mduinodali.vid.4=0x2341
mduinodali.pid.4=0x0210
mduinodali.vid.5=0x2341
mduinodali.pid.5=0x0242

mduinodali.upload.tool=avrdude
mduinodali.upload.maximum_data_size=8192
mduinodali.upload.protocol=wiring
mduinodali.upload.maximum_size=253952
mduinodali.upload.speed=115200

mduinodali.bootloader.tool=avrdude
mduinodali.bootloader.low_fuses=0xFF
mduinodali.bootloader.unlock_bits=0x3F
mduinodali.bootloader.lock_bits=0x0F
mduinodali.bootloader.high_fuses=0xD8
mduinodali.bootloader.extended_fuses=0xFD
mduinodali.bootloader.file=mduino.hex

mduinodali.build.f_cpu=16000000L
mduinodali.build.core=industrialshields
mduinodali.build.mcu=atmega2560
mduinodali.build.board=AVR_MEGA2560
mduinodali.build.usb_product="M-Duino"

## M-Duino 19R+ DALI
## -------------------------
mduinodali.menu.cpu.mduino19rplusdali=M-Duino 19R+ DALI
mduinodali.menu.cpu.mduino19rplusdali.build.variant=mduinoplus
mduinodali.menu.cpu.mduino19rplusdali.build.extra_flags=-DMDUINO_PLUS -DMDUINO_19R_PLUS -DMDUINO_DALI_PLUS

## M-Duino 21+ DALI
## -------------------------
mduinodali.menu.cpu.mduino21plusdali=M-Duino 21+ DALI
mduinodali.menu.cpu.mduino21plusdali.build.variant=mduinoplus
mduinodali.menu.cpu.mduino21plusdali.build.extra_flags=-DMDUINO_PLUS -DMDUINO_21_PLUS -DMDUINO_DALI_PLUS

