NOVA-RICS-Open-Lab/FMS/src/Arduino/boards package/industrialshields/hardware/avr/1.1.46/boards.txt
## M-Duino 38AR+ DALI
## -------------------------
mduinodali.menu.cpu.mduino38arplusdali=M-Duino 38AR+ DALI
mduinodali.menu.cpu.mduino38arplusdali.build.variant=mduinoplus
mduinodali.menu.cpu.mduino38arplusdali.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38AR_PLUS -DMDUINO_DALI_PLUS

## M-Duino 38R+ DALI
## -------------------------
mduinodali.menu.cpu.mduino38rplusdali=M-Duino 38R+ DALI
mduinodali.menu.cpu.mduino38rplusdali.build.variant=mduinoplus
mduinodali.menu.cpu.mduino38rplusdali.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38R_PLUS -DMDUINO_DALI_PLUS

## M-Duino 42+ DALI
## -------------------------
mduinodali.menu.cpu.mduino42plusdali=M-Duino 42+ DALI
mduinodali.menu.cpu.mduino42plusdali.build.variant=mduinoplus
mduinodali.menu.cpu.mduino42plusdali.build.extra_flags=-DMDUINO_PLUS -DMDUINO_42_PLUS -DMDUINO_DALI_PLUS

## M-Duino 50RRA+ DALI
## -------------------------
mduinodali.menu.cpu.mduino50rraplusdali=M-Duino 50RRA+ DALI
mduinodali.menu.cpu.mduino50rraplusdali.build.variant=mduinoplus
mduinodali.menu.cpu.mduino50rraplusdali.build.extra_flags=-DMDUINO_PLUS -DMDUINO_50RRA_PLUS -DMDUINO_DALI_PLUS

## M-Duino 53ARR+ DALI
## -------------------------
mduinodali.menu.cpu.mduino53arrplusdali=M-Duino 53ARR+ DALI
mduinodali.menu.cpu.mduino53arrplusdali.build.variant=mduinoplus
mduinodali.menu.cpu.mduino53arrplusdali.build.extra_flags=-DMDUINO_PLUS -DMDUINO_53ARR_PLUS -DMDUINO_DALI_PLUS

## M-Duino 54ARA+ DALI
## -------------------------
mduinodali.menu.cpu.mduino54araplusdali=M-Duino 54ARA+ DALI
mduinodali.menu.cpu.mduino54araplusdali.build.variant=mduinoplus
mduinodali.menu.cpu.mduino54araplusdali.build.extra_flags=-DMDUINO_PLUS -DMDUINO_54ARA_PLUS -DMDUINO_DALI_PLUS

## M-Duino 57AAR+ DALI
## -------------------------
mduinodali.menu.cpu.mduino57aarplusdali=M-Duino 57AAR+ DALI
mduinodali.menu.cpu.mduino57aarplusdali.build.variant=mduinoplus
mduinodali.menu.cpu.mduino57aarplusdali.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57AAR_PLUS -DMDUINO_DALI_PLUS

## M-Duino 57R+ DALI
## -------------------------
mduinodali.menu.cpu.mduino57rplusdali=M-Duino 57R+ DALI
mduinodali.menu.cpu.mduino57rplusdali.build.variant=mduinoplus
mduinodali.menu.cpu.mduino57rplusdali.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57R_PLUS -DMDUINO_DALI_PLUS

## M-Duino 58+ DALI
## -------------------------
mduinodali.menu.cpu.mduino58plusdali=M-Duino 58+ DALI
mduinodali.menu.cpu.mduino58plusdali.build.variant=mduinoplus
mduinodali.menu.cpu.mduino58plusdali.build.extra_flags=-DMDUINO_PLUS -DMDUINO_58_PLUS -DMDUINO_DALI_PLUS

######################
#### M-Duino GPRS ####
######################

mduinogprs.name=M-Duino GPRS family

mduinogprs.vid.0=0x2341
mduinogprs.pid.0=0x0010
mduinogprs.vid.1=0x2341
mduinogprs.pid.1=0x0042
mduinogprs.vid.2=0x2A03
mduinogprs.pid.2=0x0010
mduinogprs.vid.3=0x2A03
mduinogprs.pid.3=0x0042
mduinogprs.vid.4=0x2341
mduinogprs.pid.4=0x0210
mduinogprs.vid.5=0x2341
mduinogprs.pid.5=0x0242

mduinogprs.upload.tool=avrdude
mduinogprs.upload.maximum_data_size=8192
mduinogprs.upload.protocol=wiring
mduinogprs.upload.maximum_size=253952
mduinogprs.upload.speed=115200

mduinogprs.bootloader.tool=avrdude
mduinogprs.bootloader.low_fuses=0xFF
mduinogprs.bootloader.unlock_bits=0x3F
mduinogprs.bootloader.lock_bits=0x0F
mduinogprs.bootloader.high_fuses=0xD8
mduinogprs.bootloader.extended_fuses=0xFD
mduinogprs.bootloader.file=mduino.hex

mduinogprs.build.f_cpu=16000000L
mduinogprs.build.core=industrialshields
mduinogprs.build.mcu=atmega2560
mduinogprs.build.board=AVR_MEGA2560
mduinogprs.build.usb_product="M-Duino"

## M-Duino GPRS 19R+
## -------------------------
mduinogprs.menu.cpu.mduino19rplusgprs=M-Duino 19R+ GPRS
mduinogprs.menu.cpu.mduino19rplusgprs.build.variant=mduinoplus
mduinogprs.menu.cpu.mduino19rplusgprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_19R_PLUS -DMDUINO_GPRS_PLUS

## M-Duino GPRS 21+
## -------------------------
mduinogprs.menu.cpu.mduino21plusgprs=M-Duino 21+ GPRS
mduinogprs.menu.cpu.mduino21plusgprs.build.variant=mduinoplus
mduinogprs.menu.cpu.mduino21plusgprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_21_PLUS -DMDUINO_GPRS_PLUS

## M-Duino GPRS 38AR+
## -------------------------
mduinogprs.menu.cpu.mduino38arplusgprs=M-Duino 38AR+ GPRS
mduinogprs.menu.cpu.mduino38arplusgprs.build.variant=mduinoplus
mduinogprs.menu.cpu.mduino38arplusgprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38AR_PLUS -DMDUINO_GPRS_PLUS

## M-Duino GPRS 38R+
## -------------------------
mduinogprs.menu.cpu.mduino38rplusgprs=M-Duino 38R+ GPRS
mduinogprs.menu.cpu.mduino38rplusgprs.build.variant=mduinoplus
mduinogprs.menu.cpu.mduino38rplusgprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38R_PLUS -DMDUINO_GPRS_PLUS

## M-Duino GPRS 42+
## -------------------------
mduinogprs.menu.cpu.mduino42plusgprs=M-Duino 42+ GPRS
mduinogprs.menu.cpu.mduino42plusgprs.build.variant=mduinoplus
mduinogprs.menu.cpu.mduino42plusgprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_42_PLUS -DMDUINO_GPRS_PLUS

## M-Duino GPRS 50RRA+
## -------------------------
mduinogprs.menu.cpu.mduino50rraplusgprs=M-Duino 50RRA+ GPRS
mduinogprs.menu.cpu.mduino50rraplusgprs.build.variant=mduinoplus
mduinogprs.menu.cpu.mduino50rraplusgprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_50RRA_PLUS -DMDUINO_GPRS_PLUS

## M-Duino GPRS 53ARR+
## -------------------------
mduinogprs.menu.cpu.mduino53arrplusgprs=M-Duino 53ARR+ GPRS
mduinogprs.menu.cpu.mduino53arrplusgprs.build.variant=mduinoplus
mduinogprs.menu.cpu.mduino53arrplusgprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_53ARR_PLUS -DMDUINO_GPRS_PLUS

## M-Duino GPRS 54ARA+
## -------------------------
mduinogprs.menu.cpu.mduino54araplusgprs=M-Duino 54ARA+ GPRS
mduinogprs.menu.cpu.mduino54araplusgprs.build.variant=mduinoplus
mduinogprs.menu.cpu.mduino54araplusgprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_54ARA_PLUS -DMDUINO_GPRS_PLUS

## M-Duino GPRS 57AAR+
## -------------------------
mduinogprs.menu.cpu.mduino57aarplusgprs=M-Duino 57AAR+ GPRS
mduinogprs.menu.cpu.mduino57aarplusgprs.build.variant=mduinoplus
mduinogprs.menu.cpu.mduino57aarplusgprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57AAR_PLUS -DMDUINO_GPRS_PLUS

