NOVA-RICS-Open-Lab/FMS/src/Arduino/boards package/industrialshields/hardware/avr/1.1.46/boards.txt
## M-Duino GPRS 57R+
## -------------------------
mduinogprs.menu.cpu.mduino57rplusgprs=M-Duino 57R+ GPRS
mduinogprs.menu.cpu.mduino57rplusgprs.build.variant=mduinoplus
mduinogprs.menu.cpu.mduino57rplusgprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57R_PLUS -DMDUINO_GPRS_PLUS

## M-Duino GPRS 58+
## -------------------------
mduinogprs.menu.cpu.mduino58plusgprs=M-Duino 58+ GPRS
mduinogprs.menu.cpu.mduino58plusgprs.build.variant=mduinoplus
mduinogprs.menu.cpu.mduino58plusgprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_58_PLUS -DMDUINO_GPRS_PLUS


######################
#### M-Duino LoRa ####
######################

mduinolora.name=M-Duino LoRa family

mduinolora.vid.0=0x2341
mduinolora.pid.0=0x0010
mduinolora.vid.1=0x2341
mduinolora.pid.1=0x0042
mduinolora.vid.2=0x2A03
mduinolora.pid.2=0x0010
mduinolora.vid.3=0x2A03
mduinolora.pid.3=0x0042
mduinolora.vid.4=0x2341
mduinolora.pid.4=0x0210
mduinolora.vid.5=0x2341
mduinolora.pid.5=0x0242

mduinolora.upload.tool=avrdude
mduinolora.upload.maximum_data_size=8192
mduinolora.upload.protocol=wiring
mduinolora.upload.maximum_size=253952
mduinolora.upload.speed=115200

mduinolora.bootloader.tool=avrdude
mduinolora.bootloader.low_fuses=0xFF
mduinolora.bootloader.unlock_bits=0x3F
mduinolora.bootloader.lock_bits=0x0F
mduinolora.bootloader.high_fuses=0xD8
mduinolora.bootloader.extended_fuses=0xFD
mduinolora.bootloader.file=mduino.hex

mduinolora.build.f_cpu=16000000L
mduinolora.build.core=industrialshields
mduinolora.build.mcu=atmega2560
mduinolora.build.board=AVR_MEGA2560
mduinolora.build.usb_product="M-Duino"

## M-Duino LoRa 19R+
## -------------------------
mduinolora.menu.cpu.mduino19rpluslora=M-Duino 19R+ LoRa
mduinolora.menu.cpu.mduino19rpluslora.build.variant=mduinoplus
mduinolora.menu.cpu.mduino19rpluslora.build.extra_flags=-DMDUINO_PLUS -DMDUINO_19R_PLUS -DMDUINO_LORA_PLUS

## M-Duino LoRa 21+
## -------------------------
mduinolora.menu.cpu.mduino21pluslora=M-Duino 21+ LoRa
mduinolora.menu.cpu.mduino21pluslora.build.variant=mduinoplus
mduinolora.menu.cpu.mduino21pluslora.build.extra_flags=-DMDUINO_PLUS -DMDUINO_21_PLUS -DMDUINO_LORA_PLUS

## M-Duino LoRa 38AR+
## -------------------------
mduinolora.menu.cpu.mduino38arpluslora=M-Duino 38AR+ LoRa
mduinolora.menu.cpu.mduino38arpluslora.build.variant=mduinoplus
mduinolora.menu.cpu.mduino38arpluslora.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38AR_PLUS -DMDUINO_LORA_PLUS

## M-Duino LoRa 38R+
## -------------------------
mduinolora.menu.cpu.mduino38rpluslora=M-Duino 38R+ LoRa
mduinolora.menu.cpu.mduino38rpluslora.build.variant=mduinoplus
mduinolora.menu.cpu.mduino38rpluslora.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38R_PLUS -DMDUINO_LORA_PLUS

## M-Duino LoRa 42+
## -------------------------
mduinolora.menu.cpu.mduino42pluslora=M-Duino 42+ LoRa
mduinolora.menu.cpu.mduino42pluslora.build.variant=mduinoplus
mduinolora.menu.cpu.mduino42pluslora.build.extra_flags=-DMDUINO_PLUS -DMDUINO_42_PLUS -DMDUINO_LORA_PLUS

## M-Duino LoRa 50RRA+
## -------------------------
mduinolora.menu.cpu.mduino50rrapluslora=M-Duino 50RRA+ LoRa
mduinolora.menu.cpu.mduino50rrapluslora.build.variant=mduinoplus
mduinolora.menu.cpu.mduino50rrapluslora.build.extra_flags=-DMDUINO_PLUS -DMDUINO_50RRA_PLUS -DMDUINO_LORA_PLUS

## M-Duino LoRa 53ARR+
## -------------------------
mduinolora.menu.cpu.mduino53arrpluslora=M-Duino 53ARR+ LoRa
mduinolora.menu.cpu.mduino53arrpluslora.build.variant=mduinoplus
mduinolora.menu.cpu.mduino53arrpluslora.build.extra_flags=-DMDUINO_PLUS -DMDUINO_53ARR_PLUS -DMDUINO_LORA_PLUS

## M-Duino LoRa 54ARA+
## -------------------------
mduinolora.menu.cpu.mduino54arapluslora=M-Duino 54ARA+ LoRa
mduinolora.menu.cpu.mduino54arapluslora.build.variant=mduinoplus
mduinolora.menu.cpu.mduino54arapluslora.build.extra_flags=-DMDUINO_PLUS -DMDUINO_54ARA_PLUS -DMDUINO_LORA_PLUS

## M-Duino LoRa 57AAR+
## -------------------------
mduinolora.menu.cpu.mduino57aarpluslora=M-Duino 57AAR+ LoRa
mduinolora.menu.cpu.mduino57aarpluslora.build.variant=mduinoplus
mduinolora.menu.cpu.mduino57aarpluslora.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57AAR_PLUS -DMDUINO_LORA_PLUS

## M-Duino LoRa 57R+
## -------------------------
mduinolora.menu.cpu.mduino57rpluslora=M-Duino 57R+ LoRa
mduinolora.menu.cpu.mduino57rpluslora.build.variant=mduinoplus
mduinolora.menu.cpu.mduino57rpluslora.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57R_PLUS -DMDUINO_LORA_PLUS

## M-Duino LoRa 58+
## -------------------------
mduinolora.menu.cpu.mduino58pluslora=M-Duino 58+ LoRa
mduinolora.menu.cpu.mduino58pluslora.build.variant=mduinoplus
mduinolora.menu.cpu.mduino58pluslora.build.extra_flags=-DMDUINO_PLUS -DMDUINO_58_PLUS -DMDUINO_LORA_PLUS

######################
#### M-Duino WiFi ####
######################

mduinowifi.name=M-Duino WiFi/BT family

mduinowifi.vid.0=0x2341
mduinowifi.pid.0=0x0010
mduinowifi.vid.1=0x2341
mduinowifi.pid.1=0x0042
mduinowifi.vid.2=0x2A03
mduinowifi.pid.2=0x0010
mduinowifi.vid.3=0x2A03
mduinowifi.pid.3=0x0042
mduinowifi.vid.4=0x2341
mduinowifi.pid.4=0x0210
mduinowifi.vid.5=0x2341
mduinowifi.pid.5=0x0242

mduinowifi.upload.tool=avrdude
mduinowifi.upload.maximum_data_size=8192
mduinowifi.upload.protocol=wiring
mduinowifi.upload.maximum_size=253952
mduinowifi.upload.speed=115200

mduinowifi.bootloader.tool=avrdude
mduinowifi.bootloader.low_fuses=0xFF
mduinowifi.bootloader.unlock_bits=0x3F
mduinowifi.bootloader.lock_bits=0x0F
mduinowifi.bootloader.high_fuses=0xD8
mduinowifi.bootloader.extended_fuses=0xFD
mduinowifi.bootloader.file=mduino.hex

mduinowifi.build.f_cpu=16000000L
mduinowifi.build.core=industrialshields
mduinowifi.build.mcu=atmega2560
mduinowifi.build.board=AVR_MEGA2560
mduinowifi.build.usb_product="M-Duino"

## M-Duino 19R+ WiFi/BT
## -------------------------
mduinowifi.menu.cpu.mduino19rpluswifi=M-Duino 19R+ WiFi/BT
mduinowifi.menu.cpu.mduino19rpluswifi.build.variant=mduinoplus
mduinowifi.menu.cpu.mduino19rpluswifi.build.extra_flags=-DMDUINO_PLUS -DMDUINO_19R_PLUS -DMDUINO_WIFI_PLUS

## M-Duino 21+ WiFi/BT
## -------------------------
mduinowifi.menu.cpu.mduino21pluswifi=M-Duino 21+ WiFi/BT
mduinowifi.menu.cpu.mduino21pluswifi.build.variant=mduinoplus
mduinowifi.menu.cpu.mduino21pluswifi.build.extra_flags=-DMDUINO_PLUS -DMDUINO_21_PLUS -DMDUINO_WIFI_PLUS

## M-Duino 38AR+ WiFi/BT
## -------------------------
mduinowifi.menu.cpu.mduino38arpluswifi=M-Duino 38AR+ WiFi/BT
mduinowifi.menu.cpu.mduino38arpluswifi.build.variant=mduinoplus
mduinowifi.menu.cpu.mduino38arpluswifi.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38AR_PLUS -DMDUINO_WIFI_PLUS

## M-Duino 38R+ WiFi/BT
## -------------------------
mduinowifi.menu.cpu.mduino38rpluswifi=M-Duino 38R+ WiFi/BT
mduinowifi.menu.cpu.mduino38rpluswifi.build.variant=mduinoplus
mduinowifi.menu.cpu.mduino38rpluswifi.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38R_PLUS -DMDUINO_WIFI_PLUS

## M-Duino 42+ WiFi/BT
## -------------------------
mduinowifi.menu.cpu.mduino42pluswifi=M-Duino 42+ WiFi/BT
mduinowifi.menu.cpu.mduino42pluswifi.build.variant=mduinoplus
mduinowifi.menu.cpu.mduino42pluswifi.build.extra_flags=-DMDUINO_PLUS -DMDUINO_42_PLUS -DMDUINO_WIFI_PLUS

## M-Duino 50RRA+ WiFi/BT
## -------------------------
mduinowifi.menu.cpu.mduino50rrapluswifi=M-Duino 50RRA+ WiFi/BT
mduinowifi.menu.cpu.mduino50rrapluswifi.build.variant=mduinoplus
mduinowifi.menu.cpu.mduino50rrapluswifi.build.extra_flags=-DMDUINO_PLUS -DMDUINO_50RRA_PLUS -DMDUINO_WIFI_PLUS

