NOVA-RICS-Open-Lab/FMS/src/Arduino/boards package/industrialshields/hardware/avr/1.1.46/boards.txt
## M-Duino 53ARR+ WiFi/BT
## -------------------------
mduinowifi.menu.cpu.mduino53arrpluswifi=M-Duino 53ARR+ WiFi/BT
mduinowifi.menu.cpu.mduino53arrpluswifi.build.variant=mduinoplus
mduinowifi.menu.cpu.mduino53arrpluswifi.build.extra_flags=-DMDUINO_PLUS -DMDUINO_53ARR_PLUS -DMDUINO_WIFI_PLUS

## M-Duino 54ARA+ WiFi/BT
## -------------------------
mduinowifi.menu.cpu.mduino54arapluswifi=M-Duino 54ARA+ WiFi/BT
mduinowifi.menu.cpu.mduino54arapluswifi.build.variant=mduinoplus
mduinowifi.menu.cpu.mduino54arapluswifi.build.extra_flags=-DMDUINO_PLUS -DMDUINO_54ARA_PLUS -DMDUINO_WIFI_PLUS

## M-Duino 57AAR+ WiFi/BT
## -------------------------
mduinowifi.menu.cpu.mduino57aarpluswifi=M-Duino 57AAR+ WiFi/BT
mduinowifi.menu.cpu.mduino57aarpluswifi.build.variant=mduinoplus
mduinowifi.menu.cpu.mduino57aarpluswifi.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57AAR_PLUS -DMDUINO_WIFI_PLUS

## M-Duino 57R+ WiFi/BT
## -------------------------
mduinowifi.menu.cpu.mduino57rpluswifi=M-Duino 57R+ WiFi/BT
mduinowifi.menu.cpu.mduino57rpluswifi.build.variant=mduinoplus
mduinowifi.menu.cpu.mduino57rpluswifi.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57R_PLUS -DMDUINO_WIFI_PLUS

## M-Duino 58+ WiFi/BT
## -------------------------
mduinowifi.menu.cpu.mduino58pluswifi=M-Duino 58+ WiFi/BT
mduinowifi.menu.cpu.mduino58pluswifi.build.variant=mduinoplus
mduinowifi.menu.cpu.mduino58pluswifi.build.extra_flags=-DMDUINO_PLUS -DMDUINO_58_PLUS -DMDUINO_WIFI_PLUS

######################
# M-Duino  WiFi+GPRS #
######################

mduinowifigprs.name=M-Duino WiFi/BT + GPRS family

mduinowifigprs.vid.0=0x2341
mduinowifigprs.pid.0=0x0010
mduinowifigprs.vid.1=0x2341
mduinowifigprs.pid.1=0x0042
mduinowifigprs.vid.2=0x2A03
mduinowifigprs.pid.2=0x0010
mduinowifigprs.vid.3=0x2A03
mduinowifigprs.pid.3=0x0042
mduinowifigprs.vid.4=0x2341
mduinowifigprs.pid.4=0x0210
mduinowifigprs.vid.5=0x2341
mduinowifigprs.pid.5=0x0242

mduinowifigprs.upload.tool=avrdude
mduinowifigprs.upload.maximum_data_size=8192
mduinowifigprs.upload.protocol=wiring
mduinowifigprs.upload.maximum_size=253952
mduinowifigprs.upload.speed=115200

mduinowifigprs.bootloader.tool=avrdude
mduinowifigprs.bootloader.low_fuses=0xFF
mduinowifigprs.bootloader.unlock_bits=0x3F
mduinowifigprs.bootloader.lock_bits=0x0F
mduinowifigprs.bootloader.high_fuses=0xD8
mduinowifigprs.bootloader.extended_fuses=0xFD
mduinowifigprs.bootloader.file=mduino.hex

mduinowifigprs.build.f_cpu=16000000L
mduinowifigprs.build.core=industrialshields
mduinowifigprs.build.mcu=atmega2560
mduinowifigprs.build.board=AVR_MEGgprsA2560
mduinowifigprs.build.usb_product="gprsM-Duino"

## M-Duino 19R+ WiFi/BT
## -------------------------
mduinowifigprs.menu.cpu.mduino19rpluswifigprs=M-Duino 19R+ WiFi/BT + GPRS
mduinowifigprs.menu.cpu.mduino19rpluswifigprs.build.variant=mduinoplus
mduinowifigprs.menu.cpu.mduino19rpluswifigprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_19R_PLUS -DMDUINO_WIFI_GPRS_PLUS

## M-Duino 21+ WiFi/BT
## -------------------------
mduinowifigprs.menu.cpu.mduino21pluswifigprs=M-Duino 21+ WiFi/BT + GPRS
mduinowifigprs.menu.cpu.mduino21pluswifigprs.build.variant=mduinoplus
mduinowifigprs.menu.cpu.mduino21pluswifigprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_21_PLUS -DMDUINO_WIFI_GPRS_PLUS

## M-Duino 38AR+ WiFi/BT
## -------------------------
mduinowifigprs.menu.cpu.mduino38arpluswifigprs=M-Duino 38AR+ WiFi/BT + GPRS
mduinowifigprs.menu.cpu.mduino38arpluswifigprs.build.variant=mduinoplus
mduinowifigprs.menu.cpu.mduino38arpluswifigprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38AR_PLUS -DMDUINO_WIFI_GPRS_PLUS

## M-Duino 38R+ WiFi/BT
## -------------------------
mduinowifigprs.menu.cpu.mduino38rpluswifigprs=M-Duino 38R+ WiFi/BT + GPRS
mduinowifigprs.menu.cpu.mduino38rpluswifigprs.build.variant=mduinoplus
mduinowifigprs.menu.cpu.mduino38rpluswifigprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_38R_PLUS -DMDUINO_WIFI_GPRS_PLUS

## M-Duino 42+ WiFi/BT
## -------------------------
mduinowifigprs.menu.cpu.mduino42pluswifigprs=M-Duino 42+ WiFi/BT + GPRS
mduinowifigprs.menu.cpu.mduino42pluswifigprs.build.variant=mduinoplus
mduinowifigprs.menu.cpu.mduino42pluswifigprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_42_PLUS -DMDUINO_WIFI_GPRS_PLUS

## M-Duino 50RRA+ WiFi/BT
## -------------------------
mduinowifigprs.menu.cpu.mduino50rrapluswifigprs=M-Duino 50RRA+ WiFi/BT + GPRS
mduinowifigprs.menu.cpu.mduino50rrapluswifigprs.build.variant=mduinoplus
mduinowifigprs.menu.cpu.mduino50rrapluswifigprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_50RRA_PLUS -DMDUINO_WIFI_GPRS_PLUS

## M-Duino 53ARR+ WiFi/BT
## -------------------------
mduinowifigprs.menu.cpu.mduino53arrpluswifigprs=M-Duino 53ARR+ WiFi/BT + GPRS
mduinowifigprs.menu.cpu.mduino53arrpluswifigprs.build.variant=mduinoplus
mduinowifigprs.menu.cpu.mduino53arrpluswifigprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_53ARR_PLUS -DMDUINO_WIFI_GPRS_PLUS

## M-Duino 54ARA+ WiFi/BT
## -------------------------
mduinowifigprs.menu.cpu.mduino54arapluswifigprs=M-Duino 54ARA+ WiFi/BT + GPRS
mduinowifigprs.menu.cpu.mduino54arapluswifigprs.build.variant=mduinoplus
mduinowifigprs.menu.cpu.mduino54arapluswifigprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_54ARA_PLUS -DMDUINO_WIFI_GPRS_PLUS

## M-Duino 57AAR+ WiFi/BT
## -------------------------
mduinowifigprs.menu.cpu.mduino57aarpluswifigprs=M-Duino 57AAR+ WiFi/BT + GPRS
mduinowifigprs.menu.cpu.mduino57aarpluswifigprs.build.variant=mduinoplus
mduinowifigprs.menu.cpu.mduino57aarpluswifigprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57AAR_PLUS -DMDUINO_WIFI_GPRS_PLUS

## M-Duino 57R+ WiFi/BT
## -------------------------
mduinowifigprs.menu.cpu.mduino57rpluswifigprs=M-Duino 57R+ WiFi/BT + GPRS
mduinowifigprs.menu.cpu.mduino57rpluswifigprs.build.variant=mduinoplus
mduinowifigprs.menu.cpu.mduino57rpluswifigprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_57R_PLUS -DMDUINO_WIFI_GPRS_PLUS

## M-Duino 58+ WiFi/BT
## -------------------------
mduinowifigprs.menu.cpu.mduino58pluswifigprs=M-Duino 58+ WiFi/BT + GPRS
mduinowifigprs.menu.cpu.mduino58pluswifigprs.build.variant=mduinoplus
mduinowifigprs.menu.cpu.mduino58pluswifigprs.build.extra_flags=-DMDUINO_PLUS -DMDUINO_58_PLUS -DMDUINO_WIFI_GPRS_PLUS

############################
###### Spartan #############
############################

