NOVA-RICS-Open-Lab/FMS/src/Arduino/boards package/industrialshields/hardware/avr/1.1.46/boards.txt
spartan.name=Spartan family
spartan.build.core=industrialshields
spartan.build.board=Spartan

## Spartan 16DA
## -------------------------
spartan.menu.cpu.spartan16da=Spartan 16DA

spartan.menu.cpu.spartan16da.vid.0=0x2341
spartan.menu.cpu.spartan16da.pid.0=0x0036
spartan.menu.cpu.spartan16da.vid.1=0x2341
spartan.menu.cpu.spartan16da.pid.1=0x8036
spartan.menu.cpu.spartan16da.vid.2=0x2A03
spartan.menu.cpu.spartan16da.pid.2=0x0036
spartan.menu.cpu.spartan16da.vid.3=0x2A03
spartan.menu.cpu.spartan16da.pid.3=0x8036

spartan.menu.cpu.spartan16da.upload.tool=avrdude
spartan.menu.cpu.spartan16da.upload.protocol=avr109
spartan.menu.cpu.spartan16da.upload.maximum_size=28672
spartan.menu.cpu.spartan16da.upload.maximum_data_size=2560
spartan.menu.cpu.spartan16da.upload.speed=460800
spartan.menu.cpu.spartan16da.upload.disable_flushing=true
spartan.menu.cpu.spartan16da.upload.use_1200bps_touch=true
spartan.menu.cpu.spartan16da.upload.wait_for_upload_port=true

spartan.menu.cpu.spartan16da.bootloader.tool=avrdude
spartan.menu.cpu.spartan16da.bootloader.low_fuses=0xff
spartan.menu.cpu.spartan16da.bootloader.high_fuses=0xd8
spartan.menu.cpu.spartan16da.bootloader.extended_fuses=0xcb
spartan.menu.cpu.spartan16da.bootloader.file=ardbox.hex
spartan.menu.cpu.spartan16da.bootloader.unlock_bits=0x3F
spartan.menu.cpu.spartan16da.bootloader.lock_bits=0x2F

spartan.menu.cpu.spartan16da.build.mcu=atmega32u4
spartan.menu.cpu.spartan16da.build.f_cpu=16000000L
spartan.menu.cpu.spartan16da.build.vid=0x2341
spartan.menu.cpu.spartan16da.build.pid=0x8036
spartan.menu.cpu.spartan16da.build.usb_product="Spartan"
spartan.menu.cpu.spartan16da.build.board=AVR_LEONARDO
spartan.menu.cpu.spartan16da.build.variant=spartan
spartan.menu.cpu.spartan16da.build.extra_flags={build.usb_flags} -DSPARTAN -DSPARTAN_16DA

## Spartan 16RDA
## -------------------------
spartan.menu.cpu.spartan16rda=Spartan 16RDA

spartan.menu.cpu.spartan16rda.vid.0=0x2341
spartan.menu.cpu.spartan16rda.pid.0=0x0036
spartan.menu.cpu.spartan16rda.vid.1=0x2341
spartan.menu.cpu.spartan16rda.pid.1=0x8036
spartan.menu.cpu.spartan16rda.vid.2=0x2A03
spartan.menu.cpu.spartan16rda.pid.2=0x0036
spartan.menu.cpu.spartan16rda.vid.3=0x2A03
spartan.menu.cpu.spartan16rda.pid.3=0x8036

spartan.menu.cpu.spartan16rda.upload.tool=avrdude
spartan.menu.cpu.spartan16rda.upload.protocol=avr109
spartan.menu.cpu.spartan16rda.upload.maximum_size=28672
spartan.menu.cpu.spartan16rda.upload.maximum_data_size=2560
spartan.menu.cpu.spartan16rda.upload.speed=460800
spartan.menu.cpu.spartan16rda.upload.disable_flushing=true
spartan.menu.cpu.spartan16rda.upload.use_1200bps_touch=true
spartan.menu.cpu.spartan16rda.upload.wait_for_upload_port=true

spartan.menu.cpu.spartan16rda.bootloader.tool=avrdude
spartan.menu.cpu.spartan16rda.bootloader.low_fuses=0xff
spartan.menu.cpu.spartan16rda.bootloader.high_fuses=0xd8
spartan.menu.cpu.spartan16rda.bootloader.extended_fuses=0xcb
spartan.menu.cpu.spartan16rda.bootloader.file=ardbox.hex
spartan.menu.cpu.spartan16rda.bootloader.unlock_bits=0x3F
spartan.menu.cpu.spartan16rda.bootloader.lock_bits=0x2F

spartan.menu.cpu.spartan16rda.build.mcu=atmega32u4
spartan.menu.cpu.spartan16rda.build.f_cpu=16000000L
spartan.menu.cpu.spartan16rda.build.vid=0x2341
spartan.menu.cpu.spartan16rda.build.pid=0x8036
spartan.menu.cpu.spartan16rda.build.usb_product="Spartan"
spartan.menu.cpu.spartan16rda.build.board=AVR_LEONARDO
spartan.menu.cpu.spartan16rda.build.variant=spartan
spartan.menu.cpu.spartan16rda.build.extra_flags={build.usb_flags} -DSPARTAN -DSPARTAN_16RDA

## Spartan 19R
## -------------------------
spartan.menu.cpu.spartan19r=Spartan 19R

spartan.menu.cpu.spartan19r.vid.0=0x2341
spartan.menu.cpu.spartan19r.pid.0=0x0010
spartan.menu.cpu.spartan19r.vid.1=0x2341
spartan.menu.cpu.spartan19r.pid.1=0x0042
spartan.menu.cpu.spartan19r.vid.2=0x2A03
spartan.menu.cpu.spartan19r.pid.2=0x0010
spartan.menu.cpu.spartan19r.vid.3=0x2A03
spartan.menu.cpu.spartan19r.pid.3=0x0042
spartan.menu.cpu.spartan19r.vid.4=0x2341
spartan.menu.cpu.spartan19r.pid.4=0x0210
spartan.menu.cpu.spartan19r.vid.5=0x2341
spartan.menu.cpu.spartan19r.pid.5=0x0242

spartan.menu.cpu.spartan19r.upload.tool=avrdude
spartan.menu.cpu.spartan19r.upload.protocol=wiring
spartan.menu.cpu.spartan19r.upload.maximum_size=253952
spartan.menu.cpu.spartan19r.upload.maximum_data_size=8192
spartan.menu.cpu.spartan19r.upload.speed=115200

spartan.menu.cpu.spartan19r.bootloader.tool=avrdude
spartan.menu.cpu.spartan19r.bootloader.low_fuses=0xff
spartan.menu.cpu.spartan19r.bootloader.high_fuses=0xd8
spartan.menu.cpu.spartan19r.bootloader.extended_fuses=0xfd
spartan.menu.cpu.spartan19r.bootloader.file=mduino.hex
spartan.menu.cpu.spartan19r.bootloader.unlock_bits=0x3f
spartan.menu.cpu.spartan19r.bootloader.lock_bits=0x0f

spartan.menu.cpu.spartan19r.build.f_cpu=16000000L
spartan.menu.cpu.spartan19r.build.mcu=atmega2560
spartan.menu.cpu.spartan19r.build.board=AVR_MEGA2560
spartan.menu.cpu.spartan19r.build.usb_product="Spartan"
spartan.menu.cpu.spartan19r.build.variant=spartan
spartan.menu.cpu.spartan19r.build.extra_flags={build.usb_flags} -DSPARTAN -DSPARTAN_19R

## Spartan 21
## -------------------------
spartan.menu.cpu.spartan21=Spartan 21

spartan.menu.cpu.spartan21.vid.0=0x2341
spartan.menu.cpu.spartan21.pid.0=0x0010
spartan.menu.cpu.spartan21.vid.1=0x2341
spartan.menu.cpu.spartan21.pid.1=0x0042
spartan.menu.cpu.spartan21.vid.2=0x2A03
spartan.menu.cpu.spartan21.pid.2=0x0010
spartan.menu.cpu.spartan21.vid.3=0x2A03
spartan.menu.cpu.spartan21.pid.3=0x0042
spartan.menu.cpu.spartan21.vid.4=0x2341
spartan.menu.cpu.spartan21.pid.4=0x0210
spartan.menu.cpu.spartan21.vid.5=0x2341
spartan.menu.cpu.spartan21.pid.5=0x0242

spartan.menu.cpu.spartan21.upload.tool=avrdude
spartan.menu.cpu.spartan21.upload.protocol=wiring
spartan.menu.cpu.spartan21.upload.maximum_size=253952
spartan.menu.cpu.spartan21.upload.maximum_data_size=8192
spartan.menu.cpu.spartan21.upload.speed=115200

spartan.menu.cpu.spartan21.bootloader.tool=avrdude
spartan.menu.cpu.spartan21.bootloader.low_fuses=0xff
spartan.menu.cpu.spartan21.bootloader.high_fuses=0xd8
spartan.menu.cpu.spartan21.bootloader.extended_fuses=0xfd
spartan.menu.cpu.spartan21.bootloader.file=mduino.hex
spartan.menu.cpu.spartan21.bootloader.unlock_bits=0x3f
spartan.menu.cpu.spartan21.bootloader.lock_bits=0x0f

spartan.menu.cpu.spartan21.build.f_cpu=16000000L
spartan.menu.cpu.spartan21.build.mcu=atmega2560
spartan.menu.cpu.spartan21.build.board=AVR_MEGA2560
spartan.menu.cpu.spartan21.build.usb_product="Spartan"
spartan.menu.cpu.spartan21.build.variant=spartan
spartan.menu.cpu.spartan21.build.extra_flags={build.usb_flags} -DSPARTAN -DSPARTAN_21
